

const AbChapter3 = () => {
    return (
        <div className="min-h-screen bg-black text-yellow-400 my-4 p-3">
            <h3 className="text-lg md:text-xl font-bold text-center"> ৩য় অধ্যায় <br />
                সংখ্যা পদ্ধতি</h3>

            <p className="text-lg text-center font-semibold">জ্ঞান ও অনুধাবনমূলক </p> <br />
            <p className="text-base text-center font-semibold underline text-orange-600">জ্ঞানমূলক </p> <br />

            <div className="text-sm md:text-base md:text-center">


                ১।সংখ্যা পদ্ধতির বেজ কী?   <br />
                কোন সংখ্যা পদ্ধতি লিখে প্রকাশ করার জন্য যতগুলো মৌলিক চিহ্নের প্রয়োজন হয় তাকে ঐ সংখ্যা পদ্ধতির বেজ বা ভিত্তি বলে।    <br />  <br />
                ২। সংখা পদ্ধতি বলতে কী বুঝ?   <br />
                বিভিন্ন সাংকেতিক চিহ্ন বা অঙ্ক ব্যবহার করে সংখ্যা লিখে প্রকাশ করার পদ্ধতিকে সংখ্যা পদ্ধতি বলে।   <br />   <br />
                ৩। Bit কী?   <br />
                Binary Digit এর সংক্ষিপ্ত রুপ হচ্ছে বিট।   <br />   <br />
                ৪। বাইনারি সংখ্যা পদ্ধতি কী?   <br />
                যে সংখ্যা পদ্ধতিতে দুটি অঙ্ক বা চিহ্ন ব্যবহার করা হয় তাকে বাইনারি সংখ্যা পদ্ধতি বলে।    <br />  <br />
                ৫। কোড কী?   <br />
                কম্পিউটারকে বিভিন্ন প্রতীক,চিহ্ন বা সংখ্যা বুঝানোর জন্য বাইনারি সংখ্যার সাহায্যে যে একক সংকেত তৈরি করা হয় তাকে কোড বলে।   <br />  <br />
                ৬। ২ এর পরিপূরক কী?  <br />
                কোন বাইনারি সংখ্যার ১ এর পরিপূরকের সাথে ১ যোগ করলে যে বাইনারি মান পাওয়া যায় তাকে ২ এর পরিপূরক বলে।   <br />  <br />
                ৭। BCD কোড কী?  <br />
                BCD এর পূর্ণরুপ Binary Coded Decimal.দশমিক সংখ্যাকে ৪ বিট করে বাইনারিতে রুপান্তরকে BCD বলে।   <br />  <br />
                ৮। ASCII এর পূর্ণরুপ কী?  <br />
                ASCII এর পূর্ণরুপ American Standard Code for Information Interchange.   <br />  <br />
                ৯। ASCII-8 কী?   <br />
                ASCII তে ৮ বিটের সাহায্যে ২৮=২৫৬ টি প্রতীক চিহ্নের জন্য যে কোড তৈরি করা হয় তাকে ASCII-8 বলে।   <br />  <br />
                ১০।ক্যারি বিট কী?   <br />
                অতিরিক্ত বিট বা হাতে থাকা বিটকে ক্যারি বিট বলা হয়।   <br />  <br />
                ১১। ইউনিকোড কী?   <br />
                Unicode হলো Universal Code বা সার্বজনীন কোড। Unicode এ ১৬ বিটের সাহায্যে ২১৬=৬৫৫৩৬ টি প্রতীক চিহ্নের জন্য কোড তৈরি করা হয়।   <br />  <br />
                ১২। নেগেশন কী?  <br />
                কোন ধনাত্মক সংখ্যাকে ঋণাত্মক সংখায় বা কোন ঋণাত্মক সংখ্যাকে ধনাত্মক সংখ্যায় পরিবর্তন করাকে নেগেশন (Negation) বলে।   <br />  <br />
                ১৩। নিবল কী?  <br />
                এক বাইটের অর্ধেককে নিবল বলা হয়।   <br />  <br />
                ১৪। রেডিক্স পয়েন্ট (Radix Point) কী?  <br />
                পজিশনাল সংখ্যা পদ্ধতিতে কোন সংখ্যার পূর্ণ অংশ  ও ভগ্নাংশকে আলাদা করার জন্য যে চিহ্ন ব্যবহৃত হয় তাকে রেডিক্স পয়েন্ট বলে।   <br />  <br />
                <br /> <br />
            </div>

            <p className="text-lg text-center font-semibold my-4 text-orange-600 underline">অনুধাবনমূলক </p> <br />

            <div className="text-sm md:text-base md:text-center">
                ১। ৩ ভিত্তিক সংখ্যা পদ্ধতি ব্যাখ্যা কর।  <br />
                যে সংখ্যা পদ্ধতিতে ৩ টি মৌলিক চিহ্ন বিদ্যমান তাকে ৩ ভিত্তিক সংখ্যা পদ্ধতি বলে। এর অঙ্কসমূহঃ০,১,২ । ৩ ভিত্তিক সংখ্যা পদ্ধতিতে যেকোন সংখ্যা এই ৩টি অঙ্কের সাহায্যে গঠিত হবে। যেমনঃ ১০,১০২,২১ ইত্যাদি।
                <br />  <br />
                ২। 5D কোন ধরণের সংখ্যা ? ব্যাখ্যা কর।  <br />
                5D হেক্সাডেসিমেল সংখ্যা ।আমরা জানি হেক্সাডেসিমেল সংখ্যা পদ্ধতির ভিত্তি ১৬ । এর অঙ্কসমূহঃ ০,১,২,৩,৪,৫,৬,৭,৮,৯,A,B,C,D,E,F  ।উদ্দীপক সংখ্যাটিতে হেক্সাডেসিমেলের দুটি অঙ্ক ব্যবহার করা হয়েছে ।
                এজন্য 5D হেক্সাডেসিমেল সংখ্যা।   <br />  <br />

                ৩। (২৯৮)৮ সংখ্যাটি সঠিক কী-না ব্যাখ্যা কর।   <br />
                (২৯৮)৮ সংখ্যাটি সঠিক নয়।
                এখানে সংখ্যাটির বেজ উল্লেখ করা আছে ৮ যা অক্ট্যাল সংখ্যা পদ্ধতিকে নির্দেশ করে। অক্ট্যাল সংখ্যা পদ্ধতির অঙ্ক ০ থেকে ৭ পর্যন্ত। কিন্তু সংখ্যাটিতে ৯ ও ৮ আছে যা অক্ট্যাল সংখ্যা পদ্ধতির হতে পারেনা। এজন্য (২৯৮)৮ সংখ্যাটি সঠিক নয়।
                <br />  <br />
                ৪। ৩+৫=১০ কেন? ব্যাখ্যা কর।   <br />
                এটি একটি অক্ট্যাল যোগ।
                দশমিক সংখ্যা পদ্ধতিতে  ৩+৫=৮ ।
                দশমিক ৮ এর অক্ট্যাল মান ১০। দশমিক পদ্ধতিতে ৭ এর পর ৮ হলেও অক্ট্যালে ৭ এর পর ১০ হয় কেননা অক্ট্যালে ৭ এর পর আর কোন অঙ্ক নেই। এজন্য ৩+৫=১০।
                <br />  <br />

                ৫। (২৬৭)১০  সংখ্যাকে কম্পিউটার সরাসরি গ্রহণ করেনা-ব্যাখ্যা কর।   <br />
                কম্পিউটার একটি মেশিন বা যন্ত্র ।এটি শুধুমাত্র বিদ্যুতের উপস্থিতি ও অনুপস্থিতি বুঝতে পারে যা বাইনারি সংখ্যার ১ ও ০ দ্বারা নির্দেশ করা যায়। অর্থাৎ কম্পিউটার শুধু বাইনারি সংখ্যা বুঝতে পারে।উদ্দীপকে উল্লেখিত সংখ্যাটি দশমিক সংখ্যা।দশমিক সংখ্যা কম্পিউটার সরাসরি বুঝতে পারেনা। প্রথমে সংখ্যাটিকে বাইনারিতে রুপান্তর করে তারপর বুঝতে পারে।
                <br />  <br />
                ৬। কোন যুক্তিতে ১+১=১ এবং ১+১=১০ হয়,ব্যাখ্যা কর।   <br />
                ১+১=১ এটি একটি লজিক্যাল বা যৌক্তিক যোগ যা OR গেইট দ্বারা বাস্তবায়ন করা যায়।OR গেটের  ইনপুট গুলোর মধ্যে যেকোন একটি ইনপুট ১ হলে আউটপুট ১ হয়। এজন্য ১+১=১ । অপরদিকে ১+১=১০ এটি একটি বাইনারি যোগ।দশমিক পদ্ধতিতে ১+১=২ আবার ২ এর বাইনারি মান ১০ । এজন্য ১+১=১০ হয়।
                <br />  <br />
                ৭। অক্ট্যাল তিন বিটের কোড-বুঝিয়ে লিখ।    <br />
                অক্ট্যাল সংখ্যা পদ্ধতির বেজ ৮ । এতে অঙ্ক আছে ০ থেকে ৭ পর্যন্ত।বাইনারি সংখ্যাকে ৩ বিট করে সাজিয়ে এর অঙ্কসমূহের মান পাওয়া যায়।অর্থাৎ অক্ট্যালের অঙ্কসমূহ প্রকাশ করার জন্য ৩ টি করে বিটের প্রয়োজন হয়।যেমনঃ১১০১০০ এর অক্ট্যাল মান=৬৪
                ১১০  ১০০
                ৬ 	৪



                <br />  <br />


                ৮। ২ এর পরিপূরক গঠনের প্রয়োজনীয়তা ব্যাখ্যা কর।
                অথবা,২ এর পরিপূরক ডিজিটাল বর্তনীকে সরল করে-ব্যাখ্যা কর।   <br />
                বাইনারি সংখ্যার ১ এর পরিপূরকের সাথে ১ যোগ করলে ২ এর পরিপূরক পাওয়া যায়।২ এর পরিপূরক গঠনের প্রয়োজনীয়তা-
                •	২ এর পরিপূরক গঠনের ফলে বিয়োগের কাজ যোগের মাধ্যমে করা যায়।
                •	২ এর পরিপূরক গঠনে যোগ ও বিয়োগের জন্য একই বর্তনী ব্যবহার করা যায়।এতে সার্কিটের মাত্রা কমে ও জটিলতা কম হয়।
                •	২ এর পরিপূরক গঠন ব্যবহার করে সরল লজিক বর্তনী তৈরি করা যায় যা দামে সস্তা ও দ্রুতগতিতে কাজ করে।

                <br />  <br />
                ৯। বিয়োগের কাজ যোগের মাধ্যমে সম্ভব-ব্যাখ্যা কর।   <br />
                ২ এর পরিপূরক ব্যবহার করে বিয়োগের কাজ যোগের মাধ্যমে করা যায়।বাইনারি সংখ্যার ১ এর পরিপূরকের সাথে ১ যোগ করলে ২ এর পরিপূরক পাওয়া যায়। এক্ষেত্রে ঋণাত্মক সংখ্যার ২ এর পরিপূরক নির্ণয় করতে হয়,তারপর ধনাত্মক সংখ্যার বাইনারি মানের সাথে যোগ করে ফলাফল বের করতে হয়।অর্থাৎ ২ এর পরিপূরকের সাহায্যে বিয়োগের কাজ যোগের মাধ্যমে করা যায়।
                <br />  <br />
                ১০। ইউনিকোডের পূর্বে সবচেয়ে বেশী ব্যবহৃত আলফানিউমেরিক কোডটি ব্যাখ্যা কর।   <br />
                ইউনিকোডের পূর্বে সবচেয়ে বেশী ব্যবহৃত আলফানিউমেরিক কোডটি হলো অ্যাসকি(ASCII) কোড। ASCII এর পূর্ণরুপ American Standard Code for Information Interchange.
                মাইক্রো কম্পিউটারে এ কোডের ব্যপক প্রচলন রয়েছে।কম্পিউটার এবং ইনপুট/আউটপুট ডিভাইসের মধ্যে আলফানিউমেরিক তথ্য আদান-প্রদানে এটি ব্যবহৃত হয়। ASCII তে ৮ বিটের সাহায্যে ২৮=২৫৬ টি চিহ্নকে নির্দিষ্ট করা যায়।

                <br />  <br />
                ১১। ইউনিকোড বিশ্বের সকল ভাষাভাষী মানুষের জন্য আশীর্বাদ-বুঝিয়ে লিখ।   <br />
                অথবা, ইউনিকোড ‘বাংলা’ ভাষা বুঝতে পারে-ব্যাখ্যা কর।
                অথবা,বিশ্বের সকল ভাষাকে কোডভুক্ত করা সম্ভব হয়েছে-ব্যাখ্যা কর।
                ইউনিকোড হলো ইউনিভার্সাল কোড।বিশের সকল ভাষাকে কম্পিউটারে কোডভুক্ত করার জন্য বড় বড় কোম্পানিগুলো একটি মান তৈরি করেছে যাকে ইউনিকোড বলা হয়।ইউনিকোড বিশ্বের সকল ভাষাভাষী মানুষের জন্য আশীর্বাদ কারণ এর মাধ্যমে বিশ্বের সকল ভাষা ব্যবহার করে কম্পিউটারে প্রক্রিয়াকরণ করা যায়।এটি ১৬ বিটের কোড। এর মাধ্যমে ২১৬=৬৫৫৩৬ টি ভিন্ন অক্ষরকে প্রকাশ করা যায়। ইউনিকোডের সাহায্যে বাংলাসহ যেকোন ভাষায় কোড লেখা যায়।
            </div>




        </div>
    );
};

export default AbChapter3;