import writingImage from '../../../assets/pen.svg'

const Chapter2 = () => {
    return (
        <div className='bg-black text-yellow-400'>
            <h3 className="font-bold text-center my-4">২য় অধ্যায় <br />

                কমিউনিকেশন সিস্টেমস ও নেটওয়ার্কিং</h3>

            <div className="w-[90%] mx-auto  p-2 text-sm md:text-base mb-4">
                <div className='flex'>
                    <img src={writingImage} className='w-5 h-5' alt="pen" />
                    <p className="font-bold">কমিউনিকেশন </p>
                </div>
                এক পক্ষ হতে অন্য পক্ষে কোন মাধ্যম দ্বারা তথ্য প্রবাহের প্রক্রিয়াকে কমিউনিকেশন বলে। একটি কমিউনিকেশন সিস্টেমে সাধারণত তিনটি অংশ পাওয়া যায়। এগুলো হলো-<br />
                ১। প্রেরণকারী
                ২। গ্রহণকারী
                ৩। মাধ্যম <br /> <br />
                বিভিন্ন ধরণের কমিউনিকেশন সিস্টেমস <br />
                o	 বায়োলজিক্যাল কমিউনিকেশন <br />
                o	 গ্রাফিক কমিউনিকেশন <br />
                o	 টেলি-কমিউনিকেশন <br />  <br />
                <hr className="bg-slate-600 h-1 " /> <br />


                <div className='flex'>
                    <img src={writingImage} className='w-5 h-5' alt="pen" />
                    <p className="font-bold">ডেটা কমিউনিকেশন   </p>
                </div>

                এক ডিভাইস থেকে অন্য ডিভাইস কিংবা এক কম্পিউটার থেকে অন্য কম্পিউটারে তথ্যের আদান-প্রদানকে ডেটা কমিউনিকেশন বলে। <br /> <br />
                	সব কমিউনিকেশন কখনোই ডেটা কমিউনিকেশন হিসেবে বিবেচ্য হবে না।  <br /> <br />
                <u>ডেটা কমিউনিকেশনের উপাদান </u> <br />
                একটি ডেটা কমিউনিকেশন সিস্টেম সাধারণত ৫ টি উপাদান নিয়ে গঠিত হয়।  <br />
                ১। মেসেজ  <br />
                ২। প্রেরক  <br />
                ৩। প্রাপক  <br />
                ৪। মাধ্যম  <br />
                ৫। প্রোটোকল  <br />  <br />


                ১। মেসেজঃ যে ডেটা পাঠানো হয় তাই মেসেজ। মেসেজ বিভিন্ন ধরণের হতে পারে। যেমনঃটেক্সট,ছবি,অডিও,ভিডিও ইত্যাদি।  <br /> <br />

                ২। প্রেরকঃ প্রেরক হলো এক ধরণের ডিভাইস,যা ডেটা বা মেসেজ প্রেরণ করে। বিভিন্ন ধরণের প্রেরক ডিভাইস হতে পারে। যেমনঃ কম্পিউটার, মোবাইল ফোন, ওয়ার্ক্স্টেশন ইত্যাদি।  <br /> <br />

                ৩। প্রাপকঃ প্রাপক হলো এমন এক ধরণের ডিভাইস যা মেসেজ গ্রহণ করে। বিভিন্ন ধরণের প্রাপক ডিভাইস হতে পারে। যেমনঃ কম্পিউটার, মোবাইল ফোন, ওয়ার্ক্স্টেশন ইত্যাদি।  <br /> <br />

                ৪। মাধ্যমঃ মাধ্যম হচ্ছে পাথ,যার মাধ্যমে প্রেরক ডিভাইস থেকে প্রাপক ডিভাইসে ডেটা পাথানো হয়। যেমন কোএক্সিয়াল ক্যাবল,টুইস্টেড পেয়ার ক্যাবল,ফাইবার অপটিক ক্যাবল বা রেডিও ওয়েভ ইত্যাদি।  <br /><br />

                ৫। প্রোটোকলঃ দুটি নেটওয়ার্ক ডিভাইসের মধ্যে তথ্য স্থানান্তর করার জন্য যে নিয়মনীতির মাধ্যমে যোগাযোগ স্থাপন করা হয় তাকে প্রোটোকল বলা হয়।  <br />  <br />

                <hr className="bg-slate-600 h-1 " /> <br />


                <div className='flex'>
                    <img src={writingImage} className='w-5 h-5' alt="pen" />
                    <p className="font-bold">ব্যান্ডউইথ   </p>
                </div>

                একটি নির্দিষ্ট সময়ে কোন চ্যানেল দিয়ে যে পরিমাণ ডেটা প্রবাহিত হয় তার পরিমাণকে ব্যান্ডউইথ বলে। একে ডেটা ট্রান্সমিশন স্পিড হিসেবেও চিহ্নিত করা হয়ে থাকে।  <br />
                এর একক  bps(bit per second) । <br />  <br />


                bps(bit per second):  <br />
                প্রতি সেকেন্ডে যে পরিমাণ বিট ট্রান্সফার হয় তার পরিমাণকে bps বলে। তথ্যের ক্ষুদ্রতম একক বিট। এর আরো কিছু একক রয়েছে।  <br />
                b= 1 bit  <br />
                Kb= 1024b  <br />
                Mb= 1024Kb  <br />
                Gb= 1024Mb  <br />
                Tb= 1024Gb  <br />
                Pb= 1024Tb  <br /> <br />

                <u>ব্যান্ডউইথ বা কমিউনিকেশন গতির শ্রেণিবিভাগ </u> <br /> <br />
                ডেটা ট্রান্সফার গতির উপর ভিত্তি করে কমিউনিকেশন গতিকে ৩ ভাগে ভাগ করা হয়।  <br />
                ১। ন্যারোব্যান্ড  <br />
                ২। ভয়েসব্যান্ড  <br />
                ৩। ব্রডব্যান্ড  <br />   <br />

                ১। ন্যারোব্যান্ড   <br />
                o	 ন্যারোব্যান্ড সাধারণত ৪৫ থেকে ৩০০ bps পর্যন্ত হয়ে থাকে।  <br />
                o	 এটি ধীরগতি সম্পন্ন ডেটা ট্রান্সমিশনের ক্ষেত্রে ব্যবহার করা হয়।  <br />
                o	এর ফ্রিকুয়েন্সি ৩০০ থেকে ৩৪০০ হার্টজ।  <br />
                ব্যবহারঃ ওয়াকিটকি,ব্লুটুথ,জিগবি,টু ওয়ে রেডিও ইত্যাদি।  <br />  <br />

                ২। ভয়েসব্যান্ড  <br />
                o	 ভয়েসব্যান্ড্যের গতি সাধারণত ৯৬০০ bps পর্যন্ত হয়ে থাকে।  <br />
                o	 এটি সাধারণত টেলিফোনে বেশি ব্যবহৃত হয়ে থাকে।  <br />
                o	এর ফ্রিকুয়েন্সি ৩০০ থেকে ৩৬০০ হার্টজ।  <br />
                ব্যবহারঃ কম্পিউটার থেকে প্রিন্টার,কীবোর্ড থেকে কম্পিউটার,কার্ড রিডার থেকে কম্পিউটার,ডায়াল আপ মডেমে ডেটা স্থানান্তরে এটি ব্যবহৃত হয়।  <br />  <br />

                ৩। ব্রডব্যান্ড  <br />
                o	উচ্চগতিসম্পন্ন ডেটা স্থানান্তর প্রক্রিয়ায় ব্রডব্যান্ড ব্যবহার করা হয়ে থাকে।  <br />
                o	ব্রডব্যান্ডে বিস্তৃত ব্যান্ডউইথ এবং অধিক তথ্য বহনের ক্ষমতা থাকে।  <br />
                o	 এ ব্যান্ডের গতি ১ mbps বা তার চেয়ে বেশী হয়ে থাকে।  <br />
                ব্যবহারঃ ডিএসএল,রেডিওলিঙ্ক,অপটিক্যাল ফাইবার,মাইক্রোওয়েভ এবং স্যাটেলাইট কমিউনিকেশনে এটি ব্যবহৃত হয়ে থাকে।  <br />  <br />

                <hr className="bg-slate-600 h-1 " /> <br />


                <div className='flex'>
                    <img src={writingImage} className='w-5 h-5' alt="pen" />
                    <p className="font-bold">ডেটা ট্রান্সমিশন মেথড    </p>
                </div>

                যে পদ্ধতিতে এক ডিভাইস থেকে অন্য ডিভাইসে ডেটা ট্রান্সফার হয় তাকে ডেটা ট্রান্সমিশন মেথড বলে।  <br />
                <u>ডেটা ট্রান্সমিশন মেথড মূলত ২ ধরণেরঃ</u>  <br />
                ১। প্যারালাল ট্রান্সমিশন  <br />
                ২। সিরিয়াল ট্রান্সমিশন  <br />  <br />

                <div className="ml-5">
                    ১। প্যারালাল ট্রান্সমিশন  <br />
                    যে ট্রান্সমিশন পদ্ধতিতে বিটসমূহ একসাথে সমান্তরালে একই ক্লক পালসে স্থানান্তরিত হয় তাকে প্যারালাল ট্রান্সমিশন বলে।  <br />
                    স্বল্প দূরত্বে অবস্থিত ডিভাইসসমূহের মধ্যে ডেটা ট্রান্সমিশনে এটি ব্যবহৃত হয়।  <br />  <br />

                    ২। সিরিয়াল ট্রান্সমিশন  <br />
                    যে ট্রান্সমিশন পদ্ধতিতে বিটসমূহ একসাথে ট্রান্সফার না হয়ে সিরিয়াল বা ধারাবাহিকভাবে স্থানান্তরিত হয় তাকে সিরিয়াল ট্রান্সমিশন বলে।  <br />
                    যেকোন দূরত্বে অবস্থিত ডিভাইস সমূহের মধ্যে ডেটা ট্রান্সমিশনে এটি ব্যবহৃত হয়।  <br /> <br />
                </div>

                বিট সিনক্রোনাইজেশনের উপর ভিত্তি করে সিরিয়াল ট্রান্সমিশন পদ্ধতিকে ৩ ভাগে ভাগ করা যায়।  <br />
                ১। অ্যাসিনক্রোনাস ট্রান্সমিশন  <br />
                ২। সিনক্রোনাস ট্রান্সমিশন  <br />
                ৩। আইসোক্রোনাস ট্রান্সমিশন  <br />  <br />

                ১। অ্যাসিনক্রোনাস ট্রান্সমিশন  <br />
                যে ট্রান্সমিশন পদ্ধতিতে ডেটা ক্যারেক্টার বাই ক্যারেক্টার ট্রান্সমিট হয় তাকে অ্যাসিনক্রোনাস ট্রান্সমিশন বলে।  <br />
                অ্যাসিনক্রোনাস ট্রান্সমিশন-  <br />
                •	এ পদ্ধতিতে ডেটা ক্যারেক্টার বাই ক্যারেক্টার ট্রান্সমিট হয়।  <br />
                •	এতে স্টার্ট এবং স্টপ বিটের প্রয়োজন হয়।  <br />
                •	প্রাইমারি স্টোরেজ ডিভাইসের প্রয়োজন হয় না।  <br />
                •	অল্প পরিমাণ ডেটা ট্রান্সমিটের ক্ষেত্রে ইন্টারনেটে ব্যবহার সুবিধাজনক।  <br />
                •	কম্পিউটার থেকে প্রিন্টারে,কীবোর্ড থেকে কম্পিউটারে, কার্ড রিডার থেকে কম্পিউটারে ডেটা ট্রান্সমিশনে এটি  ব্যবহৃত হয়।  <br />  <br />
                ২। সিনক্রোনাস ট্রান্সমিশন  <br />
                যে ট্রান্সমিশন পদ্ধতিতে ডেটা ব্লক বা প্যাকেট আকারে ট্রান্সফার হয় তাকে সিনক্রোনাস ট্রান্সমিশন বলে।  <br />  <br />

                সিনক্রোনাস ট্রান্সমিশন-  <br />
                •	এ পদ্ধতিতে ডেটা ব্লক বা প্যাকেট আকারে ট্রান্সমিট হয়।  <br />
                •	এতে স্টার্ট এবং স্টপ বিটের প্রয়োজন হয় না। প্রতি ব্লক ডেটার শুরুতে একটি হেডার ও শেষে একটি ট্রেইলর ইনফরমেশন থাকে।  <br />
                •	প্রাইমারি স্টোরেজ ডিভাইসের প্রয়োজন হয় ।  <br />
                •	Asynchronous এর চেয়ে গতি বেশী ।  <br />
                •	কম্পিউটার থেকে কম্পিউটারে ডেটা ট্রান্সমিশনে এ পদ্ধতি ব্যবহৃত হয়।  <br />
                **ইন্টারনেটে ডেটা ট্রান্সমিশন মেথড হিসেবে অ্যাসিনক্রোনাস এবং সিনক্রোনাস উভয় মেথডই ব্যবহৃত হয়ে থাকে।  <br />  <br />

                ৩। আইসোক্রোনাস ট্রান্সমিশন-  <br />
                যে ট্রান্সমিশন পদ্ধতিতে কোন প্রকার দেরি ছাড়া একক সময়ে সমস্ত ডেটা ব্লক বা প্যাকেট আকারে ট্রান্সফার করা হয় তাকে আইসোক্রোনাস ডেটা ট্রান্সমিশন বলে।  <br />
                সাধারণত রিয়েল টাইম এপ্লিকেশনের ডেটা ট্রান্সফারে এ পদ্ধতি বেশি ব্যবহৃত হয়। যেমন-লাইভ টিভি সম্প্রচার,স্ট্রিমিং ভিডিও ইত্যাদি।  <br />  <br />


                <hr className="bg-slate-600 h-1 " /> <br />

                <div className='flex'>
                    <img src={writingImage} className='w-5 h-5' alt="pen" />
                    <p className="font-bold">ডেটা ট্রান্সমিশন মোড     </p>
                </div>

                উৎস থেকে গন্তব্যে ডেটা ট্রান্সফারের ক্ষেত্রে ডেটা প্রবাহের দিককে ডেটা ট্রান্সমিশন মোড বলে।  <br />
                <u>দিকের বৈশিষ্ট্যের ভিত্তিতে ডেটা ট্রান্সমিশন মোড ৩ ধরণেরঃ </u> <br />
                ১। সিমপ্লেক্স  <br />
                ২। হাফ ডুপ্লেক্স  <br />
                ৩। ফুল ডুপ্লেক্স  <br />  <br />
                ১। সিমপ্লেক্স  <br />
                ডেটার একদিকে প্রবাহকে সিমপ্লেক্স মোড বলা হয়।  <br />
                উদাহরণ- রেডিও,টেলিভিশন,কীবোর্ড থেকে কম্পিউটার,কম্পিউটার থেকে মাল্টিমিডিয়া প্রজক্টরে সিমপ্লেক্স মোড ব্যবহৃত হয়।  <br />  <br />
                ২। হাফ ডুপ্লেক্স  <br />
                যে ট্রান্সমিশন মোডে প্রেরক ও প্রাপক উভয়দিক থেকে ডেটা প্রেরণ করা যায় তবে তা একই সময়ে সম্ভব নয় তাকে হাফ ডুপ্লেক্স মোড বলে।  <br />
                উদাহরণ-ওয়াকিটকি,ইন্টারনেট ব্রাউজিং ।  <br />  <br />
                ৩। ফুল ডুপ্লেক্স  <br />
                যে ট্রান্সমিশন মোডে প্রেরক ও প্রাপক উভয়দিক থেকে একই সময়ে ডেটা আদান-প্রদান করা যায় তাকে ফুল ডুপ্লেক্স মোড বলে।  <br />
                উদাহরণ-টেলিফন,মোবাইল ফোন।  <br />  <br />


                <u>প্রাপকের সংখ্যা ও ডেটা গ্রহণের অধিকারের উপর ভিত্তি করে মোড বিভিন্ন প্রকার হতে পারে। </u> <br /> <br />
                ১। ইউনিকাস্ট  <br />
                যে ট্রান্সমিশন পদ্ধতিতে একজন প্রেরক থেকে একজন প্রাপকের মধ্যে ডেটা আদান-প্রদান হয়ে থাকে তাকে ইউনিকাস্ট মোড বলা হয়। উদাহরণ-মোবাইল ফোন,টেলিফোন,ওয়েব ব্রাউজার,tcp,http ইত্যাদি।  <br />  <br />



                ২। ব্রডকাস্ট  <br />
                যে ট্রান্সমিশন পদ্ধতিতে কোন প্রেরক থেকে ডেটা ট্রান্সমিট হলে নেটওয়ার্কভুক্ত সকল নোডই(প্রাপক) তা গ্রহণ করতে পারে তাকে ব্রডকাস্ট মোড বলা হয়।  <br />
                উদাহরণ-রেডিও,টেলিভিশন সম্প্রচার।


                ৩। মাল্টিকাস্ট
                যে ট্রান্সমিশন পদ্ধতিতে কোন প্রেরক থেকে ডেটা ট্রান্সমিট হলে নেটওয়ার্কভুক্ত শুধু অনুমোদিত নোড(প্রাপক) তা গ্রহণ করতে পারে তাকে মাল্টিকাস্ট মোড বলা হয়।
                উদাহরণ-অডিও ও ভিডিও কনফারেন্সিং,গ্রুপ এসএমএস ।  <br />  <br />


                ৪। অ্যানিকাস্ট  <br />
                অ্যানকাস্টে প্রাপকসমূহের মধ্যে তুলনামুলক কম দূরত্বের প্রাপকের কাছে ডেটা পাঠানোর চেষ্টা করা হয়।  <br />
                উদাহরণ-IPv6 প্রোটোকল,ডিএনএস ক্লায়েন্ট,ক্লাউড কম্পিউটিং ।  <br />  <br />




                ৫। জিওকাস্ট  <br />
                জিওকাস্টে প্রেরক থেকে ডেটা নির্দিষ্ট জিওগ্রাফিক্যাল এরিয়ার প্রাপকের কাছে পাঠানো হয়।  <br />
                উদাহরণ-জিওগ্রাফিক অ্যাডভার্টাইজিং,জিওগ্রাফিক মেসেজিং।  <br />  <br />


                <hr className="bg-slate-600 h-1 " /> <br />

                <div className='flex'>
                    <img src={writingImage} className='w-5 h-5' alt="pen" />
                    <p className="font-bold">ডেটা কমিউনিকেশন মাধ্যম    </p>
                </div>

                যার মধ্য দিয়ে উৎস থেকে গন্তব্যে ডেটা ট্রান্সমিশন হয় তাকে ডেটা কমিউনিকেশন মাধ্যম বলে।  <br />
                ডেটা কমিউনিকেশন মাধ্যম ২ ধরণেরঃ  <br />
                ১। ক্যাবল বা তার মাধ্যম  <br />
                ২। তারবিহীন মাধ্যম  <br />  <br />
                ১। ক্যাবল বা তার মাধ্যম  <br />
                বহুলব্যবহৃত ক্যাবলগুলো হলো-  <br />
                ১। কোএক্সিয়াল ক্যাবল  <br />
                ২। টুইস্টেড পেয়ার ক্যাবল  <br />
                ৩। ফাইবার অপটিক ক্যাবল  <br />  <br />
                ১। কোএক্সিয়াল ক্যাবল  <br />
                সাধারণত বাসা-বাড়ীতে যে তার দিয়ে ক্যাবল টিভি বা ডিশ টিভির কানেকশন দেয়া হয় সেটাই কোএক্সিয়াল ক্যাবল।  <br />
                কোএক্সিয়াল ক্যাবল- <br />
                o	এর কেন্দ্রে একটি সলিড কপার তার এবং তারটিকে ঘিরে প্লাস্টিক ফোমের ইনসুলেশন থাকে।  <br />
                o	ইনসুলেশন ফোমের চারপাশ জাল আকৃতির তার দ্বারা সাজানো থাকে এবং বাইরে প্লাস্টিকের জ্যাকেট দ্বারা ঢাকা থাকে।  <br />
                o	এ ক্যাবল ব্যবহার করে এক কিলোমিটার পর্যন্ত দূরত্বে ডিজিটাল ডেটা প্রেরণ করা যায়।  <br />
                o	তবে ডেটা ট্রান্সফার রেট তারের দৈর্ঘ্যের উপর নির্ভর করে।  <br />
                o	এর ডেটা ট্রান্সফার রেট ২০০ Mbps পর্যন্ত হতে পারে।  <br />  <br />
                কোএক্সিয়াল ক্যাবল ২ প্রকার।  <br />

                ১। থিননেট  <br />
                একে 10 base 2 বলা হয়। অর্থাৎ এর ব্যান্ডউইথ 10Mbps এবং এর দৈর্ঘ্য ২০০ মিটার।  <br />

                ২। থিকনেট  <br />
                একে 10 base 5 বলা হয়। অর্থাৎ এর ব্যান্ডউইথ 10Mbps এবং এর দৈর্ঘ্য ৫০০ মিটার। তবে এর ডেটা ট্রান্সফার রেট 100Mbps  হতে 2Gbps পর্যন্ত হতে পারে।  <br /><br />

                ২। টুইস্টেড পেয়ার ক্যাবল  <br />
                টেলিফোন লাইনের কানেকশন বা স্বল্প খরচে কম দূরত্বে নেটওয়ার্ক তৈরির জন্য যে ক্যাবলটি ব্যবহার হয় সেটি হলো টুইস্টেড পেয়ার ক্যাবল।  <br />

                টুইস্টেড পেয়ার ক্যাবল-  <br />
                o	এ ক্যাবলে সাধারণত ৪ জোড়া তার একসাথে থাকে এবং প্রতি জোড়ায় একটি কমন সাদা রঙের তার থাকে,বাকী তারগুলো ভিন্ন রঙের হয়।  <br />
                o	এর ব্যান্ডউইথ 10Mbps থেকে 1Gbps ।  <br />
                o	এট অন্যান্য ক্যাবলের চেয়ে দামে সস্তা।  <br />
                o	সহজে স্থাপন করা যায়।  <br />
                o	এর ডেটা ট্রান্সমিশন লস বেশী।  <br />
                o	ব্যবহারঃ লোকাল এরিয়া নেটওয়ার্ক বা ইথারনেটে,সকল ধরণের টেলিফোন নেটওয়ার্কে,বাসাবাড়ি,শিক্ষা প্রতিষ্ঠান বা বিভিন্ন বাণিজ্যিক প্রতিষ্ঠানে ব্রডব্যান্ড ইন্টারনেট কানেকশনে।  <br />
                <br />

                টুইস্টেড পেয়ার ক্যাবল ২ ধরণেরঃ  <br />
                ১। আবরণহীন টুইস্টেড পেয়ার বা ইউটিপি (UTP)  <br />


                ২। আবরণযুক্ত টুইস্টেড পেয়ার বা এসটিপি (STP)  <br /><br />


                ৩। ফাইবার অপটিক ক্যাবল  <br />
                o	অপটিক্যাল ফাইবার অত্যন্ত সরু কাচতন্তু দ্বারা নির্মিত এক ধরণের আলো পরিবাহী তার।  <br />
                o	এ ক্যাবলের মাধ্যমে ডেটা আদান-প্রদানের জন্য লেজার রশ্মি ব্যবহার করা হয়।  <br />
                o	নন-মেটালিক ক্যাবল মাধ্যম হলো অপটিক্যাল ফাইবার।  <br />  <br />


                অপটিক্যাল ফাইবারের ৩ টি স্তর থাকে।  <br />
                কোর,ক্ল্যাডিং,জ্যাকেট ।  <br />  <br />

                কোর  <br />
                কোর হলো সবচেয়ে ভিতরের স্তর যার মধ্য দিয়ে আলোক সিগন্যাল সঞ্চালন করে। এটি মাল্টি কম্পোনেন্ট কাঁচ বা স্বচ্ছ প্লাস্টিক দিয়ে তৈরি।  <br />

                ক্ল্যাডিং  <br />
                কোরকে ঘিরে থাকা বাইরের স্তরটি হচ্ছে ক্ল্যাডিং,যা কাঁচের তৈরি।এটি কোর থেকে নির্গত আলোকরশ্মি প্রতিফলিত করে তা পুনরায় কোরে ফেরত  <br />
                পাঠায়।  <br />

                জ্যাকেট  <br />
                ক্ল্যাডিং এর উপর প্লাস্টিক দিয়ে মোড়ানো আবরণটিকে জ্যাকেট বলা হয়। এটি ফাইবার অপটিক তারকে ঘর্ষণ,মরিচা,জলীয় বাষ্প থেকে রক্ষা
                করে।  <br />  <br />

                ফাইবার অপটিক ক্যাবলের সুবিধা  <br />

                	 আলোর গতিতে ডেটা ট্রান্সফার হয় বলে সর্বাপেক্ষা দ্রুতগতিসম্পন্ন।  <br />
                	 নেটওয়ার্কের ব্যাকবোন হিসেবে ব্যবহার করা যায়।  <br />
                	 আকারে ছোট এবং ওজন অত্যন্ত কম।  <br />
                	 বিদ্যুৎ চৌম্বক প্রভাব (EMI) মুক্ত।  <br />
                	 ডেটা সংরক্ষণের নিরাপত্তা ও গোপনীয়তা বেশী।  <br />
                	 ট্রান্সমিশন লস কম।  <br />  <br />

                ফাইবার অপটিক ক্যাবলের অসুবিধা  <br />
                	 ইন্সটলেশন খরচ অনেক বেশী।  <br />
                	 অপটিক্যাল ফাইবার ভঙ্গুর। একে U আকৃতিতে বাঁকানো যায় না।  <br />
                	 মেইনটেইন করতে দক্ষ লোকের প্রয়োজন হয়।  <br />  <br />
                ফাইবার অপটিক ক্যাবলের ব্যবহার  <br />
                •	 টেলিকমিউনিকেশনের ক্ষেত্রে সমূদ্রের তলদেশ দিয়ে পৃথিবীর সকল মহাদেশের মধ্যে সংযোগ স্থাপনে।  <br />
                •	 বিভিন্ন মেডিক্যাল ডিভাইস তৈরিতে।  <br />
                •	অত্যাধুনিক সেন্সর তৈরিতে।  <br />
                •	ইন্টারনেট ক্যাবল ও ডিশ টিভির ক্যাবলে।  <br />

            </div>


        </div>
    );
};

export default Chapter2;